[ { "_id" : { "$oid" : "547a7d995e63927850f095cd"} , "Id" : 1 , "Title" : "Legend has it that Pulau Ubin was formed when an Elephant and a Pig merged after losing a race to a Frog" , "CorrectAnswer" : 1 , "Source" : "http://remembersingapore.org/2012/06/29/singapore-legends-and-myths/" , "Explanation" : "How did the island of Pulau Ubin form in the first place?  A legendary tale explains that in the early days, an elephant, a pig and a frog challenged one another to reach the Johor shores from mainland Singapore. The stakes were high, as those who did not succeed would be turned into rock. The frog, being the first to try, failed to cross the straits and was turned into Pulau Sekudu. Pulau Sekudu literally means Frog Island in Malay.  The elephant and the pig were the next to attempt the feat. They did not make it too, thus both of them fused together to become the main island of Pulau Ubin." , "ImageURL" : "01a" , "ImageBG" : "01" , "GoogleMapArgs" : "https://goo.gl/maps/sHlyv" , "GeoLocation" : "1.402361, 103.970389" , "Tags" : "History, Nature, Legend" , "Sponsored" : 0 , "Author" : "Ferdi" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user1"} , { "_id" : { "$oid" : "547a7d995e63927850f095ce"} , "Id" : 2 , "Title" : "According to legend, Bukit Merah (Red Hill) is named after blood staining it when a little boy whoi had saved Singapore was killed by Sultan" , "CorrectAnswer" : 1 , "Source" : "http://remembersingapore.org/2012/06/29/singapore-legends-and-myths/" , "Explanation" : "A long time ago, the southern coast of Singapore was infested by numerous fierce swordfish. The villagers and fishermen could not ply their trades at the sea, as they would be attacked by these fearsome creatures if they ever ventured near the waters. The people requested help from the Sultan, but even him and his royal army could not do anything about it.  A little boy then proposed a solution to the Sultan. Build a row of barricade made of banana tree trunks along the affected coast, he said. When the swordfish tried to attack the villagers again, their pointed beaks would pierce through the barricade and would be trapped immediately.  The plan worked perfectly, and the smart boy became popular among the villagers as their saviour. This invited jealousy from the Sultan. Fearing his rule would be threatened in the future, he sent his soldiers to kill the boy who lived on top of a hill. As the poor boy died, his blood flew down the hill, soaking the whole hill red. This was how Redhill, or Bukit Merah (literally means hill red), got its name." , "ImageURL" : "02a" , "ImageBG" : "02" , "GoogleMapArgs" : "https://goo.gl/maps/23Lw2" , "GeoLocation" : "1.2742785,103.8242005" , "Tags" : "History, Dark, Legend" , "Sponsored" : 0 , "Author" : "Andy" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user2"} , { "_id" : { "$oid" : "547a7d995e63927850f095cf"} , "Id" : 3 , "Title" : "Legend has it that the Merlion saved Temasek (old Singapore) from being engulfed by waves" , "CorrectAnswer" : 1 , "Source" : "http://remembersingapore.org/2012/06/29/singapore-legends-and-myths/" , "Explanation" : "One night, the villagers living by the southern coast of Temasek were awakened by the howling winds and the crashing waves. The dark clouds blocked out the lights of the moon and the stars, turning the world in complete darkness. It was as though the island of Temasek would be engulfed by the raging sea. The terrified villagers sank on their knees in prayers.  During this moment, a bright light was observed emerging from the southern waters. A massive creature, half lion and half fish, roared in anger. The battle between the fierce mystical animal and nature was intense, as the sky was filled with flashing lightnings. The villagers had never witnessed such terrifying phenomenons before.  After some time, the winds began to die down, the waves subsided and the sky started to clear. The gigantic sea beast had won the battle against the nature. As it claimed its victory, it stood proudly on Mount Imbiah of Pulau Belakang Mati (Sentosa). By morning, the merlion had retreated into its waters, leaving behind a bright colourful trail." , "ImageURL" : "03a" , "ImageBG" : "03" , "GoogleMapArgs" : "https://goo.gl/maps/n045g" , "GeoLocation" : "1.254861, 103.818778" , "Tags" : "History, Legend" , "Sponsored" : 0 , "Author" : "Nino" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user3"} , { "_id" : { "$oid" : "547a7d9a5e63927850f095d0"} , "Id" : 4 , "Title" : "There are hot springs you can bathe in on an airforce base in Singapore" , "CorrectAnswer" : 1 , "Source" : "http://www.timeoutsingapore.com/aroundtown/feature/secret-singapore-around-town" , "Explanation" : "http://en.wikipedia.org/wiki/Sembawang_Hot_Spring" , "ImageURL" : "04a" , "ImageBG" : "04" , "GoogleMapArgs" : "https://goo.gl/maps/Yy4Vm" , "GeoLocation" : "1.441250, 103.814222" , "Tags" : "Experiences" , "Sponsored" : 0 , "Author" : "Michelle" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user4"} , { "_id" : { "$oid" : "547a7d9a5e63927850f095d1"} , "Id" : 5 , "Title" : "This photo was taken in Singapore" , "CorrectAnswer" : 1 , "Source" : "http://blog.omy.sg/safra/2014/03/30/singapores-best-kept-secret-lazarus-island/" , "Explanation" : "Translucent turquoise waters, inviting foamy surf and an unspoilt powdery beach... I've never dreamed of using those adjectives on Singapore's beaches but a virgin trip to Lazarus Island had filled my vocabulary with praises for this little known piece of paradise!" , "ImageURL" : "05a" , "ImageBG" : "05" , "GoogleMapArgs" : "NULL" , "GeoLocation" : "1.223472, 103.853944" , "Tags" : "Experiences, Nature" , "Sponsored" : 0 , "Author" : "Tom" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user5"} , { "_id" : { "$oid" : "547a7d9a5e63927850f095d2"} , "Id" : 6 , "Title" : "There's a place where, for the price of a bottle of wine, you can see an angel fly" , "CorrectAnswer" : 1 , "Source" : "http://divinewinesingapore.com/" , "Explanation" : "The 'Batman Building' in Bugis is a masterpiece of art deco, and waitresses are flown up above the bar to get your bottle of wine. The wine cellar extends upwards for 2 stores in the magnificent lobby  The spectacular centrepiece is the 12 metre high Wine tower. Holding up to 3000 bottles, it chills over 200 varieties of the world's finest wine vintages. Winging aloft, the world's first Wine angels use an electric hoist to sort high above the bar to retrieve the selected wine. Flights of fancy for the world's most unique high fliers. Together with an extensive wine list, Divine Wine Extraordinaire also provides a selection of premium beverages." , "ImageURL" : "06a" , "ImageBG" : "06" , "GoogleMapArgs" : "https://goo.gl/maps/duc7f" , "GeoLocation" : "1.300528, 103.857556" , "Tags" : "Nightlife" , "Sponsored" : 1 , "Author" : "Sam" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user6"} , { "_id" : { "$oid" : "547a7d9a5e63927850f095d3"} , "Id" : 7 , "Title" : "There is a bar where all the drinks are made only from organic ingredients" , "CorrectAnswer" : 1 , "Source" : "https://sg.news.yahoo.com/10-hidden-bars-singapore-secret-092300398.html" , "Explanation" : "Short for Organic Chemistry, Orgo stays true to its name through the use of organic ingredients as much as possible, both in its mixes and grub. Need evidence? Mixologist Tomoyuki Kitazoe was seen plucking some herbs from the mini-garden outside the bar. Things are kept fresh here with new cocktail concoctions conceived every few months, depending on seasonal availability of produce. Orgo takes things a notch higher with its sophisticated wall-less decor, ensuring that you get to take in the stunning view of Marina Bay Waterfront in its full glory." , "ImageURL" : "07a" , "ImageBG" : "07" , "GoogleMapArgs" : "https://goo.gl/maps/UV0ZP" , "GeoLocation" : "1.290306, 103.856417" , "Tags" : "Nightlife" , "Sponsored" : 1 , "Author" : "Alfred" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user7"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095d4"} , "Id" : 8 , "Title" : "Nestled inside a reservoir, Singapore houses an abandoned Japanese Shrine." , "CorrectAnswer" : 1 , "Source" : "http://joyloh.com/blog/?p=2803" , "Explanation" : "The Syonan Jinja (Light of the South Shrine) was a Shinto shrine built deep in the forests of the MacRitchie Reservoir to commemorate Japanese soldiers who died in the conquest of Malaya and Sumatra. Constructed between 1942 and 1943, the shrine was a venue for many public ceremonies where the local population was compelled to show obeisance to the Japanese. Before their surrender, the Japanese destroyed the shrine for fear of its desecration by returning British forces. " , "ImageURL" : "08a" , "ImageBG" : "08" , "GoogleMapArgs" : "https://www.google.com.sg/maps/place/1%C2%B020'55.1%22N+103%C2%B048'50.3%22E/@1.3475973,103.8260781,14z/data=!4m2!3m1!1s0x0:0x0?hl=en" , "GeoLocation" : "1.348639, 103.813972" , "Tags" : "History, Nature" , "Sponsored" : 0 , "Author" : "Paul" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user8"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095d5"} , "Id" : 9 , "Title" : "Beach Road, which goes past Raffles Hotel and is 3km from the coast, got its name because it used to run along the beach" , "CorrectAnswer" : 1 , "Source" : "http://www.raffles.com/singapore/" , "Explanation" : "Singapore's land mass has grown by 20% in the last 20 years due to land reclamation projects; and, it is expected to grow another 15% in mass over the next 20 years." , "ImageURL" : "09a" , "ImageBG" : "09" , "GoogleMapArgs" : "https://goo.gl/maps/PUOIF" , "GeoLocation" : "1.294500, 103.854972" , "Tags" : "History" , "Sponsored" : 1 , "Author" : "Andrew" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user9"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095d6"} , "Id" : 10 , "Title" : "Sometimes you can see the resident stray dog taking part in a weekly dragon boat racing" , "CorrectAnswer" : 1 , "Source" : "http://sdba.org.sg/" , "Explanation" : "Dragon boat racing happens every weekend on the river by the Kallang Riverside Park. Singaporeans take the sport serviously, with drumming bands playing on the riverside when a race takes place" , "ImageURL" : "10a" , "ImageBG" : 10 , "GoogleMapArgs" : "https://www.google.co.uk/maps/place/Kallang+Riverside+Park/@1.307034,103.868476,15z/data=!4m2!3m1!1s0x0:0x400dd7f687950901" , "GeoLocation" : "1.308000, 103.868389" , "Tags" : "Experiences, Sports, Culture" , "Sponsored" : 0 , "Author" : "Margaret" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user10"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095d7"} , "Id" : 11 , "Title" : "In 1967, hundreds of Singaporean men were admitted to hospital fearing that their penises would disappear" , "CorrectAnswer" : 1 , "Source" : "http://eresources.nlb.gov.sg/newspapers/Digitised/Article/straitstimes19671105.2.13.7.aspx" , "Explanation" : "Koro is a culture-specific syndrome in which the person has an overpowering belief that his penis (or other genitalia) will retract and disappear. Also known as shrinking penis, the syndrome is listed in the Diagnostic and Statistical Manual of Mental Disorders. The syndrome occurs worldwide with epidemics and mass hysteria of genital-shrinkage or disappearance occurring throughout history in Africa, Asia, and Europe.  A koro epidemic struck Singapore in October 1967 for about ten days. Newspapers initially reported that some people developed koro after eating the meat of pigs inoculated with anti-swine-flu vaccine. Rumours relating eating pork and koro spread after a further report of an inoculated pig dying from penile retraction. The cases reported amounted to 97 in a single hospital unit within one day, at five days after the original news report. Government and medical officials alleviated the outbreak only by public announcements over television and in the newspapers. " , "ImageURL" : "11a" , "ImageBG" : 11 , "GoogleMapArgs" : "NULL" , "GeoLocation" : "NULL" , "Tags" : "History" , "Sponsored" : 0 , "Author" : "Kate" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user11"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095d8"} , "Id" : 12 , "Title" : "The design for the Esplanade theatres came from an architect squashing a fly on his design" , "CorrectAnswer" : 0 , "Source" : "http://www.talkingcock.com/html/sections.php?op=viewarticle&artid=80" , "Explanation" : "It's actually designed to look like a durian (the nation's favourite fruit). You can find these all over Singapore  - if you try some, remember to hold your nose. " , "ImageURL" : "12a" , "ImageBG" : 12 , "GoogleMapArgs" : "https://www.google.co.uk/maps/place/Esplanade+-+Theatres+on+the+Bay,+Singapore/@1.2898815,103.855817,18z/data=!4m2!3m1!1s0x0000000000000000:0xb955a5f90a365835" , "GeoLocation" : "1.289833, 103.855833" , "Tags" : "Architecture, Culture" , "Sponsored" : 0 , "Author" : "Kitt" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user2"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095d9"} , "Id" : 13 , "Title" : "The original MRT announcements were made by Meryl Streep" , "CorrectAnswer" : 0 , "Source" : "http://www.lta.gov.sg/content/ltaweb/en/public-transport/mrt-and-lrt-trains.html" , "Explanation" : "NULL" , "ImageURL" : "13a" , "ImageBG" : 13 , "GoogleMapArgs" : "NULL" , "GeoLocation" : "NULL" , "Tags" : "NULL" , "Sponsored" : 0 , "Author" : "Joshua" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user1"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095da"} , "Id" : 14 , "Title" : "It is illegal in Singapore to sing obscene songs" , "CorrectAnswer" : 1 , "Source" : "NULL" , "Explanation" : "Obscene songs.  294. Whoever, to the annoyance of others -   (a) does any obscene act in any public place; or (b) sings, recites or utters any obscene song, ballad or words in or near any public place,  shall be punished with imprisonment for a term which may extend to 3 months, or with fine, or with both (Penal Code)" , "ImageURL" : "14a" , "ImageBG" : 14 , "GoogleMapArgs" : "NULL" , "GeoLocation" : "NULL" , "Tags" : "Law" , "Sponsored" : 0 , "Author" : "Ray" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user3"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095db"} , "Id" : 15 , "Title" : "There is a farmstay on a working farm in Singapore" , "CorrectAnswer" : 1 , "Source" : "http://dkranji.com.sg/our-5-hectares/" , "Explanation" : "NULL" , "ImageURL" : "15a" , "ImageBG" : 15 , "GoogleMapArgs" : "https://goo.gl/maps/IFa8z" , "GeoLocation" : "1.420028, 103.718889" , "Tags" : "Nature, Accommodation" , "Sponsored" : 1 , "Author" : "Hani" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user4"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095dc"} , "Id" : 16 , "Title" : "156 metres above ground there is a full-size brewery in Singapore" , "CorrectAnswer" : 1 , "Source" : "http://www.level33.com.sg/concept.html" , "Explanation" : "Level33 the world's highest urban craft brewery, one can experience an unequaled dining experience complete with one of the best views of Singapore's Marina Bay and city skyline." , "ImageURL" : "16a" , "ImageBG" : 16 , "GoogleMapArgs" : "https://goo.gl/maps/bckIB" , "GeoLocation" : "1.280778, 103.854167" , "Tags" : "Food and Drink" , "Sponsored" : 1 , "Author" : "Ziwei" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user5"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095dd"} , "Id" : 17 , "Title" : "You can get a spa treatment where you'll be steamed in herbs and massaged with Prata bread" , "CorrectAnswer" : 1 , "Source" : "http://www.rnspa.com.sg/" , "Explanation" : "Quirky and at times downright unbelievable, Rustic Nirvana has somehow found a following with its unusual chopstick-wielding spa techniques. There's also a range of body massages that use semi-precious stones like smoky quartz and agate. But that's not their oddest offering: the Aventurine Green Claypot Prata therapy claims to lock in the heat using prata (yes, the crispy dough bread), while jamu herbs work on the body to reduce aches and pains. There are [fb01] ve locations, including one at Gleneagles Hospital, but the original at Cantonment road is still the best.  " , "ImageURL" : "17a" , "ImageBG" : 17 , "GoogleMapArgs" : "https://goo.gl/maps/fj3Mq" , "GeoLocation" : "1.279111, 103.840222" , "Tags" : "Wellness" , "Sponsored" : 1 , "Author" : "Budha" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user6"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095de"} , "Id" : 18 , "Title" : "Every weekend morning, locals in Tiong Bahru bring their pet birds to the square for a sing-off" , "CorrectAnswer" : 1 , "Source" : "http://mothership.sg/2014/01/11-places-escape-crazy-singapore-crowd/" , "Explanation" : "It was a favorite gathering place since the sixties for bird lovers who would gather on weekend mornings to admire each others' prized pets singing in their nicely decorated cages while sipping coffee at the Ting Heng Kopitam. It even gained global fame in the late eighties when a Dutch reporter wrote about it and attracted attention from others in United States, Holland and Japan." , "ImageURL" : "18a" , "ImageBG" : 18 , "GoogleMapArgs" : "https://goo.gl/maps/gyX6Y" , "GeoLocation" : "1.285444, 103.833861" , "Tags" : "Nature, Quirky" , "Sponsored" : 0 , "Author" : "Alan" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user7"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095df"} , "Id" : 19 , "Title" : "Sungei Road Flea Market was where you went to buy back your things that were stolen from you" , "CorrectAnswer" : 1 , "Source" : "http://www.yoursingapore.com/content/traveller/en/browse/shopping/shop-by-category/curios-and-knick-knacks/sungei-road-thieves-market.html" , "Explanation" : "Sungei Road Thieves Market is one of the best and most popular flea markets in Singapore among tourists and locals alike. With more than 400 vendors selling everything from vinyl records, cuckoo clocks, tasty food and old cameras to Buddhist amulets and hiking boots, this thriving market has been here since the 1930s and it's a real shopping institution in Singapore.  Back in the old days, it was the place to go to buy stolen goods - hence the origin of its name - but today, all the items are legitimate and aboveboard. If you're sick of Singapore's stylish air-conditioned malls and want a colourful street market where you can steal a bargain or two, then don't miss this always teeming and exciting flea market." , "ImageURL" : "19a" , "ImageBG" : 19 , "GoogleMapArgs" : "https://goo.gl/maps/sYYSP" , "GeoLocation" : "1.305222, 103.856194" , "Tags" : "Quirky" , "Sponsored" : 0 , "Author" : "Debbie" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user8"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095e0"} , "Id" : 20 , "Title" : "Leopard Cats, Pangolins, Mousedeers, Flying squirrels and lemurs can be found in Singapore " , "CorrectAnswer" : 1 , "Source" : "http://www.yoursingapore.com/content/traveller/en/browse/see-and-do/nature-and-wildlife.html" , "Explanation" : "There are loads of opportunities to see exotic and rare wilflife in Singapore. Check out the nature reserves and national parks." , "ImageURL" : "20a" , "ImageBG" : 20 , "GoogleMapArgs" : "NULL" , "GeoLocation" : "NULL" , "Tags" : "Nature" , "Sponsored" : 1 , "Author" : "Harry" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user9"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095e1"} , "Id" : 21 , "Title" : "A family of elephants ran and swam away to a Singporean island" , "CorrectAnswer" : 1 , "Source" : "http://eresources.nlb.gov.sg/infopedia/articles/SIP_443_2004-12-28.html" , "Explanation" : "A family wild elephants had apparently swum 1.5 km. across the Johor Straits to reach Pulau Tekong. There are several Sinagporean islands a short boat ride away from the Singaporean mainland, which are havens for wildlife" , "ImageURL" : "21a" , "ImageBG" : 21 , "GoogleMapArgs" : "https://www.google.co.uk/maps/place/Tekong+Island,+Singapore/@1.3998826,104.0504704,14z/data=!3m1!4b1!4m2!3m1!1s0x31da397e22ef536f:0x9d18768d7f462f4d" , "GeoLocation" : "1.414389, 104.038722" , "Tags" : "Nature" , "Sponsored" : 1 , "Author" : "Holly" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user10"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095e2"} , "Id" : 22 , "Title" : "Eagles are often seen flying past balconies in the city" , "CorrectAnswer" : 1 , "Source" : "http://www.nparks.gov.sg/birds_list/" , "Explanation" : "There are 36 different species of prey birds in Singapore." , "ImageURL" : "22a" , "ImageBG" : 22 , "GoogleMapArgs" : "NULL" , "GeoLocation" : "NULL" , "Tags" : "Nature" , "Sponsored" : 1 , "Author" : "Alan" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user11"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095e3"} , "Id" : 23 , "Title" : "There are bees as big as your nose which are obsessed with passion fruit flowers" , "CorrectAnswer" : 1 , "Source" : "http://sgwildanimals.blogspot.sg/2012/10/bees-wasps-and-ants.html" , "Explanation" : "Carpenter bees are huge but harmless (mostly). They mate mid flight, and the male covers the female's eyes for the duration. They also live alone rather than in hives. " , "ImageURL" : "23a" , "ImageBG" : 23 , "GoogleMapArgs" : "NULL" , "GeoLocation" : "NULL" , "Tags" : "Nature" , "Sponsored" : 1 , "Author" : "Kent" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user1"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095e4"} , "Id" : 24 , "Title" : "Muggings are frequently carried out by monkeys in Singapore" , "CorrectAnswer" : 1 , "Source" : "NULL" , "Explanation" : "There are loads of species of monkeys in Singapore, which you can see in most of the national parks. If you sit quietly for a while, you'll see all their normal behaviour (but still hold on to your sandwiches)" , "ImageURL" : "24a" , "ImageBG" : 24 , "GoogleMapArgs" : "NULL" , "GeoLocation" : "NULL" , "Tags" : "Nature" , "Sponsored" : 1 , "Author" : "Maurice" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user2"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095e5"} , "Id" : 25 , "Title" : "The original Singapore Sling contained chicken blood" , "CorrectAnswer" : 0 , "Source" : "http://www.raffles.com/singapore/dining/long-bar/" , "Explanation" : "NULL" , "ImageURL" : "25a" , "ImageBG" : 25 , "GoogleMapArgs" : "https://goo.gl/maps/y04Qh" , "GeoLocation" : "1.295722, 103.854361" , "Tags" : "Food and Drink" , "Sponsored" : 0 , "Author" : "Simon" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user3"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095e6"} , "Id" : 26 , "Title" : "Chewing gum in Singapore is forbidden" , "CorrectAnswer" : 0 , "Source" : "NULL" , "Explanation" : "Fact: Yes, dear. You may chew gum in Singapore. And you will not get caned for it.  But: you may not import chewing gum - not even small amounts for personal use.  Back in the 80's - when the train system was put into service and public housing built out in a grand scale - people were sticking gum onto door sensors, elevators, under tables and other public places. The government decided to ban gum to avoid disruptions and servicing costs.  And: You can buy gum at dentist offices and pharmacies. Simply leave your name and address - otherwise the seller gets slapped with a hefty fine." , "ImageURL" : "26a" , "ImageBG" : 26 , "GoogleMapArgs" : "NULL" , "GeoLocation" : "NULL" , "Tags" : "Food and Drink" , "Sponsored" : 0 , "Author" : "Sophie" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user4"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095e7"} , "Id" : 27 , "Title" : "Durians have historically been used to clean" , "CorrectAnswer" : 0 , "Source" : "NULL" , "Explanation" : "Durian split opinions like no other fruit. Some would prefer to clean off the durian smell wherever they encounter it, but Durian was never used for cleaning." , "ImageURL" : "27a" , "ImageBG" : 27 , "GoogleMapArgs" : "NULL" , "GeoLocation" : "NULL" , "Tags" : "Food and Drink" , "Sponsored" : 0 , "Author" : "Xander" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user5"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095e8"} , "Id" : 28 , "Title" : "Buried underneath the Fountain of Wealth at Suntec City, one can find human remains tracing back to Sir Stamford Raffles" , "CorrectAnswer" : 0 , "Source" : "http://www.rafflescity.com.sg/" , "Explanation" : "NULL" , "ImageURL" : "28a" , "ImageBG" : 28 , "GoogleMapArgs" : "https://goo.gl/maps/fohjU" , "GeoLocation" : "1.294806, 103.858917" , "Tags" : "Architecture, History" , "Sponsored" : 0 , "Author" : "Adam" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user6"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095e9"} , "Id" : 29 , "Title" : "The Fullerton Hotel used to be the Singapore General Post Office, the Exchange, and the Chamber of Commerce" , "CorrectAnswer" : 1 , "Source" : "http://www.fullertonhotel.com/" , "Explanation" : "The Fullerton Building, built in 1928 and was the centre of Singapore's commercial, social and official life, once home to the nation's General Post Office, The Exchange, Chamber of Commerce and The Singapore Club - all of which played a pivotal role in the history of Singapore, was turned into a 400-room luxury hotel after a S$400 million makeover. The hotel officially opened her doors on January 1, 2001." , "ImageURL" : "29a" , "ImageBG" : 29 , "GoogleMapArgs" : "https://goo.gl/maps/wFwvN" , "GeoLocation" : "1.286500, 103.853056" , "Tags" : "Architecture, Culture" , "Sponsored" : 1 , "Author" : "Crystal" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user7"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095ea"} , "Id" : 30 , "Title" : "On basement level 2 in Changi Airport Terminal 3, one can find a secret Karaoke Bar" , "CorrectAnswer" : 0 , "Source" : "http://www.changiairport.com/" , "Explanation" : "NULL" , "ImageURL" : "30a" , "ImageBG" : 30 , "GoogleMapArgs" : "https://goo.gl/maps/oxwZI" , "GeoLocation" : "1.356558, 103.986035" , "Tags" : "Entertainment" , "Sponsored" : 0 , "Author" : "Emily" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user8"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095eb"} , "Id" : 31 , "Title" : "You can get a chamomile flavoured cocktail served in a vial of liquid nitrogen in a speak easy on Club St" , "CorrectAnswer" : 1 , "Source" : "http://www.timeoutsingapore.com/clubs/venues/bars/operation-dagger" , "Explanation" : "Speakeasies are an active part of the Singapore nightlife (literally, in this case). " , "ImageURL" : "31a" , "ImageBG" : 31 , "GoogleMapArgs" : "https://www.google.co.uk/maps/place/Operation+Dagger/@1.281498,103.845973,17z/data=!3m1!4b1!4m2!3m1!1s0x31da190d23493c4d:0xab8c6a6375122300" , "GeoLocation" : "1.281498, 103.845962" , "Tags" : "Food and drink" , "Sponsored" : 0 , "Author" : "Ethan" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user9"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095ec"} , "Id" : 32 , "Title" : "Grilled chicken head is a delicacy in Singapore" , "CorrectAnswer" : 0 , "Source" : "NULL" , "Explanation" : "NULL" , "ImageURL" : "32a" , "ImageBG" : 32 , "GoogleMapArgs" : "NULL" , "GeoLocation" : "NULL" , "Tags" : "Food and Drink" , "Sponsored" : 0 , "Author" : "Jeline" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user10"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095ed"} , "Id" : 33 , "Title" : "Upon checking in to Raffles Hotel, guests receive a complimentary welcome massage" , "CorrectAnswer" : 0 , "Source" : "http://www.raffles.com/singapore/" , "Explanation" : "NULL" , "ImageURL" : "33a" , "ImageBG" : 33 , "GoogleMapArgs" : "https://goo.gl/maps/PUOIF" , "GeoLocation" : "1.294500, 103.854972" , "Tags" : "Accommodation" , "Sponsored" : 1 , "Author" : "Jackson" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user11"} , { "_id" : { "$oid" : "547a7d9b5e63927850f095ee"} , "Id" : 34 , "Title" : "In the Tiong Bahru market, you can find a stall which sells tea and coffee in the same glass" , "CorrectAnswer" : 1 , "Source" : "http://www.thebestsingapore.com/best-place/tiong-bahru-wet-market/" , "Explanation" : "Called Yuanyang or Kopi Cham, you can find it at the Tiong Bahru hawker centre" , "ImageURL" : "34a" , "ImageBG" : 34 , "GoogleMapArgs" : "https://www.google.co.uk/maps/search/Tiong+Bahru+market./@1.284864,103.832393,17z/data=!3m1!4b1" , "GeoLocation" : "NULL" , "Tags" : "Food and Drink" , "Sponsored" : 0 , "Author" : "Katie" , "Guesses" : "NULL" , "CorrectGuesses" : "NULL" , "AuthorImage" : "user1"} ]